app/Controllers/Clientes.php

SELECT *
FROM `cliente`
---
    public function index(){
        $clientes = $this->cliente_model->findAll();

SELECT *
FROM `cliente`
WHERE `id_cliente` = '1'
 LIMIT 1
---
    public function editar($id_cliente){
        $clientes = $this->cliente_model->where('id_cliente', $id_cliente)->first();

UPDATE `cliente` SET `nome` = 'olf', `data_de_nascimento` = '1985-12-20', `telefone` = '3298854712', `endereco` = 'Rua etc de tal', `limite_de_credito` = '1200', `id_cliente` = '1', `updated_at` = '2023-12-22 14:28:16'
WHERE `id_cliente` = '1'
INSERT INTO `cliente` (`nome`, `data_de_nascimento`, `telefone`, `endereco`, `limite_de_credito`, `created_at`, `updated_at`) VALUES ('novo cliente', '1975-04-21', '3256894', 'sss', '2000', '2023-12-22 14:48:24', '2023-12-22 14:48:24')
---
    public function store(){
        $dados =$this->request->getVar();
        if(isset($dados['id_cliente'])):
            $this->cliente_model
                                ->where('id_cliente', $dados['id_cliente'])
                                ->set($dados)
                                ->update();
            return redirect()->to("/clientes/editar/{$dados['id_cliente']}");
        endif;


        $this->cliente_model->insert($dados);

DELETE FROM `cliente`
WHERE `id_cliente` IS NULL
---
    public function excluir($id_cliente){
        $this->cliente_model
                ->where('id_cliente', $id_cliente)
                ->delete();

SELECT *
FROM `cliente`
WHERE `id_cliente` = '7'
 LIMIT 1
---
    public function ver($id_cliente){
        $cliente = $this->cliente_model
                        ->where('id_cliente', $id_cliente)
                        ->first();