app/Controllers/Funcionarios.php

    public function index()
    {
        $data['funcionarios'] = $this->funcionario_model
                                                        ->findAll();
---
SELECT *
FROM `funcionarios`

    public function delete(){
        $id_funcionario = $this->request->getVar('id_funcionario');
        $this->funcionario_model
                                ->where('id_funcionario', $id_funcionario)
                                ->delete();
---
DELETE FROM `funcionarios`
WHERE `id_funcionario` IS NULL